<template lang="pug">
v-main.text-center
  v-row
    v-col
      .h1.font-weight-bold.mb-3.text-uppercase
        span алтайская краевая федерация
        span джиу-джитсу
      .h1
        img.animate(v-if="startAnimation" src="/img/logo.png" height="200")
  v-row
    v-col
      span Наши направления
  v-row
    v-col.text-left
      v-card.ma-2
        v-card-title
          span Файтинг
        v-card-subtitle
          span Бои
        v-card-text
          span Бои по правилам Джиу-Джитсу проводятся на татами. Во время поединка
            | спортсмены применяют ударную, бросковую технику, технику борьбы в
            | партере, болевые и удушающие приемы. Экипировка спортсменов —
            | ударно-захватные перчатки с открытыми пальцами, накладки на ноги и
            | борцовское кимоно из плотной ткани. Бой судят 3 рефери, по оценкам
            | которых определяется победитель.
      v-card.ma-2
        v-card-title
          span Не ваза
        v-card-subtitle
          span Бразильское джиу-джитсу
        v-card-text
          span Исключительно умный вид борьбы, где решающее значение имеет не
            | грубая сила и функциональная форма, а прежде всего технический
            | арсенал спортсмена. Борьба развивает чувство баланса, распределение
            | собственного веса и веса партнера во время схватки за счёт рычагов и
            | перемещений, мышление спортсмена должно быть открыто для
            | своевременного реагирования на действия соперника. Уникальность
            | этого вида борьбы заключается в том, что каждый может себе позволить
            | заниматься данным видом спорта, не зависимо от возраста и физических
            | кондиций. Методология тренировочного процесса позволяет изучить
            | множество различных подводящих упражнений, развивающих гибкость и
            | пластику передвижения. Для познания различных видов прохождения
            | контролей (guard), удержаний и техник, направленных на завершение
            | схватки путем болевого воздействия или удушающего приёма, много
            | времени уделяется работе в паре с партнёром. Не ваза (бразильское
            | джиу-джитсу) — это вид борьбы, на 80% состоящий из технических
            | действий в «партере». Много времени уделяется позиционной борьбе,
            | т.к. выгодная позиция на или под противником — это шаг к победе.
      v-card.ma-2
        v-card-title
          span Дуо-систем
        v-card-subtitle
          span Парные техники
        v-card-text
          span Парные технические соревнования проводятся между 2мя парами. Каждая
          | пара поочередно показывает свое решение т.е. технику против заданной
          | судьей атаки. Атаки это – захваты, обхваты, удары, атаки с оружием.
          | Заранее пара не знает какую именно атаку укажет рефери. После
          | проведения техник спортсменам выставляются оценки, по сумме которых
          | определяется пара – победитель. Подготовка к подобным соревнованиям
          | позволяет наработать свой собственный безотказный арсенал
          | контрприемов которые могут безошибочно спасти жизнь при нападении.
</template>

<script lang="ts" setup>
import { ref, onMounted } from 'vue'

const startAnimation = ref(false)

onMounted(() => {
  startAnimation.value = true
})
</script>
<style scoped>
@keyframes bounceIn {
  0% {
    transform: scale(0.5);
    opacity: 0;
  }

  100% {
    transform: scale(1);
    opacity: 1;
  }
}

.animate {
  animation: bounceIn 1s;
}
</style>
